In [88]:
import pandas as pd

# Criação de Series
series_idades = pd.Series([22, 24, 36, 53, 58])
series_nomes = pd.Series(['Misael', 'Emilly', 'Aldrey', 'Jussara', 'Antonio'])

In [89]:
# Criação de dataframe
df = pd.DataFrame()

In [90]:
df['nomes'] = series_nomes
df

     nomes
0   Misael
1   Emilly
2   Aldrey
3  Jussara
4  Antonio

In [91]:
df['idades'] = series_idades
df

     nomes  idades
0   Misael      22
1   Emilly      24
2   Aldrey      36
3  Jussara      53
4  Antonio      58

In [92]:
# Acessando pela coluna
df['idades']

0    22
1    24
2    36
3    53
4    58
Name: idades, dtype: int64

In [93]:
# Acessando pela linha
df.iloc[1]

nomes     Emilly
idades        24
Name: 1, dtype: object

In [94]:
# Ordenando dataframe pela coluna nomes
df = df.sort_values(by='nomes')
df

     nomes  idades
2   Aldrey      36
4  Antonio      58
1   Emilly      24
3  Jussara      53
0   Misael      22

In [95]:
# Navegando pela coluna e pelo índice.
df['nomes'].loc[1]

'Emilly'

In [96]:
# Navegando pela coluna e pela linha.
df['nomes'].iloc[1]

'Antonio'